# Madison Qualley
## Week 13 11/22/2020
## Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [3]:
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [4]:
st_map = {'Alma':'Colroado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colroado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [5]:
df['state']=df['city'].map(st_map)

df

         city  altitude       state
0        Alma     10355    Colroado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [7]:
#apply
def meter(x):
    return x / 3.808

In [8]:
df['altitude']=df['altitude'].apply(meter)

df

         city     altitude       state
0        Alma  2719.275210    Colroado
1  Brian Head  2573.529412        Utah
2    Fox Park  2379.726891     Wyoming
3   Lake Mary  2354.516807  California

In [9]:
df = DataFrame(np.random.randn(4,3),columns = list('bde'),
              index = ['UT','OH','TX','OR'])
df

           b         d         e
UT  0.441573  1.067372  0.220497
OH -0.120274  0.744078 -1.007060
TX  0.529553 -0.296498  0.383070
OR  0.303948 -2.069433 -0.394420

In [10]:
def dif(x):
    return x.max()-x.min()

In [11]:
df.apply(dif)

b    0.649827
d    3.136805
e    1.390130
dtype: float64

In [12]:
df.apply(dif, axis=1)

UT    0.846875
OH    1.751138
TX    0.826050
OR    2.373382
dtype: float64

In [15]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-2.069433  0.0  1.0  0.0
-1.007060  0.0  0.0  1.0
-0.394420  0.0  0.0  1.0
-0.296498  0.0  1.0  0.0
-0.120274  1.0  0.0  0.0
 0.220497  0.0  0.0  1.0
 0.303948  1.0  0.0  0.0
 0.383070  0.0  0.0  1.0
 0.441573  1.0  0.0  0.0
 0.529553  1.0  0.0  0.0
 0.744078  0.0  1.0  0.0
 1.067372  0.0  1.0  0.0

In [17]:
#groupby
df = DataFrame({'k1':['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
                'dataset2': np.random.randn(5)
               })

df

  k1   k2  dataset1  dataset2
0  a  one  0.407800  1.269238
1  a  two -1.679016  0.540752
2  b  one -0.001599 -1.836290
3  b  two -0.594978 -0.604297
4  c  one -0.062958 -0.068906

In [18]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [19]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [20]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [21]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.407800  1.269238
1  a  two -1.679016  0.540752
2  b  one -0.001599 -1.836290
3  b  two -0.594978 -0.604297
4  c  one -0.062958 -0.068906

In [22]:
df['dataset1'] .groupby(df['k1']).mean()

k1
a   -0.635608
b   -0.298288
c   -0.062958
Name: dataset1, dtype: float64

In [23]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a  -0.635608  0.904995
b  -0.298288 -1.220294
c  -0.062958 -0.068906

In [24]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.407800  1.269238
   two -1.679016  0.540752
b  one -0.001599 -1.836290
   two -0.594978 -0.604297
c  one -0.062958 -0.068906

In [25]:
group = df.groupby(['k1','k2']) [['datatset1']]

group.mean()

KeyError: "Columns not found: 'datatset1'"